describe('Компонент Форми', () => {
  beforeEach(() => {
    // Перехід на головну сторінку та потім на сторінку форми входу
    cy.visit('http://localhost:3000'); // Відкриваємо стартову сторінку
    cy.get('a').contains('Кабінет').click(); // Натискаємо на посилання "Кабінет" для переходу до форми
  });

  it('дозволяє користувачам переключатися між формами авторизації та реєстрації', () => {
    // Перевіряємо, чи початкова форма є формою авторизації
    cy.contains('Авторизація');

    // Перемикаємось на форму реєстрації та перевіряємо, чи вона відображається
    cy.get('span').contains('Реєструйтесь').click(); // Натискаємо на текст "Реєструйтесь"
    cy.contains('Реєстрація'); // Перевіряємо, чи відобразилась форма реєстрації

    // Перемикаємось назад на форму авторизації та перевіряємо
    cy.get('span').contains('Увійдіть').click(); // Натискаємо на текст "Увійдіть"
    cy.contains('Авторизація'); // Перевіряємо, чи відобразилась форма авторизації
  });

  it('відправляє форму авторизації та викликає функцію login', () => {
    cy.window().then((win) => {
      // Мокаємо виклик alert для перевірки успіху авторизації
      cy.stub(win, 'alert').as('alert');
    });

    // Тестові дані для введення в форму
    const email = 'testuser@example.com'; // Вказуємо тестову електронну пошту
    const password = 'testpassword'; // Вказуємо тестовий пароль

    // Вводимо логін та пароль в форму
    cy.get('input[name=email]').type(email); // Вводимо email
    cy.get('input[name=password]').type(password); // Вводимо пароль

    // Натискаємо на кнопку для відправки форми
    cy.get('button').contains('Увійти').click();

    // Перевіряємо, чи викликано alert з повідомленням про успішну авторизацію
    cy.get('@alert').should('have.been.calledWith', 'Авторизація успішна!');
  });
});
