// Створюємо об'єкт конфігурації `config`, який буде експортуватися. 
// Він містить правила для файлів з розширеннями `.js`, `.jsx`, `.css`.
const config = {
    // Це правило виконує ESLint для файлів з розширенням `.js` та `.jsx`.
    // Команда ESLint буде автоматично виправляти проблеми там, де це можливо.
    // Опції:
    // - `--ignore-path .gitignore`: використовує файл `.gitignore` для виключення певних файлів з перевірки.
    // - `--fix`: автоматично виправляє помилки лінтингу, які можна виправити.
    // - `--ext .js,.jsx`: вказує, що ESLint повинен перевіряти файли з розширеннями `.js` та `.jsx`.
    // - `./src`: обмежує перевірку файлами в папці `src`.
    '*.{js,jsx}': ['eslint --ignore-path .gitignore --fix --ext .js,.jsx ./src'],

    // Це правило виконує форматування коду за допомогою Prettier для файлів з розширеннями `.js`, `.jsx`, та `.css`.
    // Команда `prettier --write` перезапише файли з відформатованим кодом.
    '*.{js,jsx,css}': ['prettier --write'],
};

// Експортуємо конфігурацію, щоб її можна було використовувати в інших частинах проєкту.
module.exports = config;
