// Експортуємо об'єкт конфігурації для `nyc`.
module.exports = {
    // Вказуємо, які звіти мають бути створені. В даному випадку обраний звіт у форматі HTML.
    // 'reporter': перелік форматів звітів, які мають бути згенеровані. 
    // У цьому випадку це HTML, щоб можна було переглядати результати у браузері.
    reporter: ['html'],

    // 'exclude' визначає файли та директорії, які будуть виключені з аналізу покриття.
    // **/*.cy.* - виключає файли з розширенням `.cy.*` (тестові файли Cypress).
    // 'node_modules/**' - виключає всі файли та папки у `node_modules`.
    // '**/specs/**' - виключає файли та папки у папці `specs`.
    exclude: ['**/*.cy.*', 'node_modules/**', '**/specs/**'],

    // 'include' визначає, які файли мають бути включені для аналізу покриття.
    // У цьому випадку аналізуватися будуть усі файли в папці `src` та її підпапках.
    include: ['src/**/*'],

    // 'noClean' визначає, чи варто очищати дані покриття перед запуском нового тесту.
    // Якщо встановлено в true, то `nyc` не буде очищати наявні звіти перед створенням нових.
    // Це корисно, якщо ви хочете зберегти попередні результати покриття коду.
    noClean: true,
};
